       IDENTIFICATION DIVISION.
       PROGRAM-ID. Sort.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TEMP PIC 9(3).
       01 I PIC 9(3).
       01 J PIC 9(3).
       01  NUMBERS-TABLE.
           05  Arr OCCURS 100 TIMES
               INDEXED BY IDX
               PIC 9(3).
       PROCEDURE DIVISION.
           MOVE 23  TO  Arr(1)
           MOVE 69  TO  Arr(2)
           MOVE 72  TO  Arr(3)
           MOVE 41  TO  Arr(4)
           MOVE 55  TO  Arr(5)
           MOVE 6   TO  Arr(6)
           MOVE 57  TO  Arr(7)
           MOVE 3   TO  Arr(8)
           MOVE 65  TO  Arr(9)
           MOVE 37  TO  Arr(10)
           MOVE 4   TO  Arr(11)
           MOVE 48  TO  Arr(12)
           MOVE 74  TO  Arr(13)
           MOVE 27  TO  Arr(14)
           MOVE 18  TO  Arr(15)
           MOVE 9   TO  Arr(16)
           MOVE 51  TO  Arr(17)
           MOVE 76  TO  Arr(18)
           MOVE 66  TO  Arr(19)
           MOVE 100 TO  Arr(20)
           MOVE 33  TO  Arr(21)
           MOVE 87  TO  Arr(22)
           MOVE 68  TO  Arr(23)
           MOVE 42  TO  Arr(24)
           MOVE 10  TO  Arr(25)
           MOVE 35  TO  Arr(26)
           MOVE 34  TO  Arr(27)
           MOVE 8   TO  Arr(28)
           MOVE 12  TO  Arr(29)
           MOVE 31  TO  Arr(30)
           MOVE 88  TO  Arr(31)
           MOVE 52  TO  Arr(32)
           MOVE 98  TO  Arr(33)
           MOVE 99  TO  Arr(34)
           MOVE 90  TO  Arr(35)
           MOVE 5   TO  Arr(36)
           MOVE 73  TO  Arr(37)
           MOVE 21  TO  Arr(38)
           MOVE 89  TO  Arr(39)
           MOVE 81  TO  Arr(40)
           MOVE 36  TO  Arr(41)
           MOVE 2   TO  Arr(42)
           MOVE 1   TO  Arr(43)
           MOVE 47  TO  Arr(44)
           MOVE 54  TO  Arr(45)
           MOVE 24  TO  Arr(46)
           MOVE 59  TO  Arr(47)
           MOVE 30  TO  Arr(48)
           MOVE 16  TO  Arr(49)
           MOVE 13  TO  Arr(50)
           MOVE 70  TO  Arr(51)
           MOVE 19  TO  Arr(52)
           MOVE 67  TO  Arr(53)
           MOVE 94  TO  Arr(54)
           MOVE 60  TO  Arr(55)
           MOVE 43  TO  Arr(56)
           MOVE 45  TO  Arr(57)
           MOVE 25  TO  Arr(58)
           MOVE 95  TO  Arr(59)
           MOVE 26  TO  Arr(60)
           MOVE 44  TO  Arr(61)
           MOVE 49  TO  Arr(62)
           MOVE 46  TO  Arr(63)
           MOVE 96  TO  Arr(64)
           MOVE 56  TO  Arr(65)
           MOVE 7   TO  Arr(66)
           MOVE 93  TO  Arr(67)
           MOVE 20  TO  Arr(68)
           MOVE 82  TO  Arr(69)
           MOVE 97  TO  Arr(70)
           MOVE 62  TO  Arr(71)
           MOVE 39  TO  Arr(72)
           MOVE 78  TO  Arr(73)
           MOVE 86  TO  Arr(74)
           MOVE 71  TO  Arr(75)
           MOVE 58  TO  Arr(76)
           MOVE 63  TO  Arr(77)
           MOVE 14  TO  Arr(78)
           MOVE 28  TO  Arr(79)
           MOVE 29  TO  Arr(80)
           MOVE 64  TO  Arr(81)
           MOVE 79  TO  Arr(82)
           MOVE 32  TO  Arr(83)
           MOVE 77  TO  Arr(84)
           MOVE 50  TO  Arr(85)
           MOVE 75  TO  Arr(86)
           MOVE 91  TO  Arr(87)
           MOVE 22  TO  Arr(88)
           MOVE 61  TO  Arr(89)
           MOVE 53  TO  Arr(90)
           MOVE 15  TO  Arr(91)
           MOVE 83  TO  Arr(92)
           MOVE 85  TO  Arr(93)
           MOVE 84  TO  Arr(94)
           MOVE 80  TO  Arr(95)
           MOVE 11  TO  Arr(96)
           MOVE 17  TO  Arr(97)
           MOVE 92  TO  Arr(98)
           MOVE 38  TO  Arr(99)
           MOVE 40  TO  Arr(100).
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
               PERFORM VARYING J FROM I BY 1 UNTIL J > 100
                   IF Arr(I) > Arr(J)
                       MOVE Arr(I) TO TEMP
                       MOVE Arr(J) TO Arr(I)
                       MOVE TEMP   TO Arr(J)
                   END-IF
               END-PERFORM
           END-PERFORM.
       STOP RUN.
